Repository: 84000/data-translation-memory
Catalog: toh62-v3.tmx
Source language: bo
Languages: en

source: །ཟླ་མེད་སྨན་པ་ལྟ་བུར་རྣམ་པར་རྒྱུ། །སྐྱེ་དང་རྒ་དང་འཆི་དང་མྱ་ངན་ནོན།
en: “ ‘Seeing the world oppressed by birth, old age, death, and pain, Separated from what is dear,

source: །སྡུག་དང་བྲལ་དང་སྨྲེ་སྔགས་འདོན་པ་བརྒྱས། །རྟག་ཏུ་ན་བའི་འགྲོ་རྣམས་གཟིགས་ནས་ནི།
en: Uttering hundreds of lamentations, and always sick,

source: །ཐུབ་པ་ཐུགས་རྗེས་ཡོངས་སུ་འགྲེལ་ཅིང་རྒྱུ།
en: You, O Sage, make the rounds, completely liberating them, out of compassion.

source: །དུད་འགྲོ་ཡི་དགས་དམྱལ་བའི་འགྲོ་རྣམས་སུ།
en: “ ‘The whole world courses through the realms of animals, hungry ghosts, and hell beings,

source: །འགྲོ་ཀུན་ཤིང་རྟའི་འཕང་ལོ་བཞིན་དུ་འཁོར།
en: Like a chariot wheel.

source: །གླེན་པ་དམིགས་བུ་མ་མཆིས་མགོན་མ་མཆིས།
en: To simpletons without a leader or protector,

source: །དེ་ལ་ལམ་གྱི་དམ་པ་སྟོན་པར་མཛད།
en: You teach the excellent path.

source: །གཙོ་བོ་མཚུངས་པ་མེད་པས་གང་བསྟན་པ།
en: “ ‘The noble path you have taught, unrivaled chief,

source: །འཕགས་ལམ་དེ་ཉིད་གང་དག་སྔོན་ཆད་ཀྱི།
en: Was proclaimed by the victorious ones

source: །ཆོས་ཀྱི་དབང་ཕྱུག་འགྲོ་བའི་དོན་མཛད་པ།
en: Who were Dharma Lords and who acted for the welfare

source: །རྒྱལ་བ་དེ་དག་རྣམས་ཀྱིས་རབ་ཏུ་གསུངས།
en: Of the world in former times. “ ‘You utter speech that is gentle, tender, and highly pleasing,

source: །འཇམ་ཞིང་མཉེན་ལ་ཡིད་དུ་འོང་བའི་མཆོག །ཚངས་ལས་ལྷག་པར་མཆོག་ཏུ་དགའ་བགྱིད་པ།
en: That causes supreme pleasure, surpassing that of Brahmā, And that outperforms the songs

source: །དྲི་ཟ་མི་ཅི་ལྷ་ཡི་བུ་མོ་མཆོག །སྒྲ་དེ་ཟིལ་གྱིས་མནན་ནས་གསུང་བ་མཛད།
en: Of gandharvas, kinnaras, and the highest apsarases. “ ‘Having listened to this teaching,

source: །བདེན་དང་དྲང་བ་མི་ཟད་ཐབས་ཚུལ་གྱིས།
en: Which is true, honest, completely purified

source: །ཡོངས་སྦྱངས་ཡོན་ཏན་མཐའ་ཡས་ལྡན་པའི་གསུང་།
en: By inexhaustible skillful means, and endowed with limitless qualities,

source: །དེ་ཐོས་སེམས་ཅན་ཁྲག་ཁྲིག་ཕྲག་བརྒྱ་དག །ཐེག་པ་གསུམ་གྱིས་ཞི་བར་མཆི་བར་བགྱིད།
en: Myriad beings have been led to peace by the three vehicles.

source: །ཁྱོད་ལ་མཆོད་པས་ལྷ་ཡི་བདེ་བ་ནི།
en: “ ‘By worshiping you, they will obtain

source: །རྣམ་པ་མང་དང་དེ་བཞིན་མི་ཡི་འཐོབ།
en: The manifold pleasures of gods and men alike.

source: །མི་ཡི་བདག་པོ་འགྲོ་ལ་ཕན་བགྱིད་པ།
en: They will become kings, benefactors to the world

source: །ཕྱུག་ཅིང་ནོར་ཆེ་འབྱོར་བ་ཆེན་པོར་འགྱུར།
en: And rich and wealthy, with abundant possessions.

source: །མཚུངས་མེད་ཁྱོད་ལ་དང་པ་བསྐྱེད་པས་ནི།
en: “ ‘By developing faith in you, the unequaled,

source: །གླིང་བཞིའི་བདག་པོ་འཁོར་ལོས་སྒྱུར་བ་མཆོག །འགྲོ་ལ་དགེ་བ་བཅུ་པོ་ཀུན་འབྱེད་པ།
en: They will become lords of the four continents, supreme cakravartins, Who disclose the ten virtues to the world

source: །རིན་ཆེན་རབ་བཟང་བདུན་ལྡན་ཐོབ་པར་འགྱུར།
en: And obtain the excellent seven precious substances.

source: །རྒྱལ་བ་ཁྱོད་ལ་མཆོད་པ་བགྱིས་པས་ནི།
en: “ ‘Worshiping you, the Victorious One,

source: །ཚངས་པ་བརྒྱ་བྱིན་འཇིག་རྟེན་བདག་པོ་དང་། །ཡོངས་སུ་དགའ་ལྡན་ལྷ་ཡི་བདག་པོ་དང་། །གཞན་འཕྲུལ་བ་དང་འཐབ་བྲལ་རབ་དགར་འགྱུར།
en: They will become Brahmā, Śakra, or lords of the world. They will become lords of gods or lords of Tuṣita, Of the Paranirmita gods, or of the Yāma gods. “ ‘Worshiping, seeing, and hearing you, the unequaled one

source: །འགྲོ་བའི་སྡུག་བསྔལ་རྣམ་མང་སེལ་མཛད་པ།
en: Who clears away beings’ many sufferings,

source: །མཉམ་མེད་ཁྱོད་ལ་མཆོད་དང་མཐོང་བ་དང་། །ཐོས་པའང་དེ་ལྟར་འབྲས་བུ་མཆིས་ལགས་ཏེ།
en: Will thus bear fruits:

source: །གནས་མཆོག་རྒ་ཤི་མེད་པ་འཐོབ་པར་འགྱུར།
en: Beings thereby will attain the supreme state beyond aging and death.

source: །བཅོམ་ལྡན་ལམ་ལ་མཁས་ཤིང་ལམ་མཁྱེན་པ།
en: “ ‘You, Bhagavān, skilled in and knowledgeable about the path,

source: །འཇིག་རྟེན་འདི་ནི་ངན་པའི་ལམ་ལས་བཟློག །བཅོམ་ལྡན་འགྲོ་བ་དག་ནི་འཕགས་པའི་ལམ།
en: Cause this world to turn away from lower destinies. You, Bhagavān, establish beings on the noble path—

source: །བདེ་བ་ཞི་བ་རྡུལ་དང་བྲལ་འགོད་པ།
en: Restful, peaceful, and immaculate.

source: །བསོད་ནམས་གཏེར་ཁྱོད་བསོད་ནམས་དོན་གཉེར་བའི།
en: “ ‘You, treasure of merit, have been striving for merit;

source: །བསོད་ནམས་བགྱི་བ་རྟག་ཏུ་མི་བས་ཏེ། །བྱང་ཆུབ་དམ་པ་མ་ཐོབ་བར་དུ་ནི།
en: Your meritorious activity will never cease.

source: །བསྐལ་པ་བྱེ་བ་མང་པོར་བས་མི་འགྱུར།
en: It will not cease for many millions of eons, Until all beings have attained excellent enlightenment. “ ‘They will obtain a completely pure buddhafield,

source: །གཞན་འཕྲུལ་འདྲ་བ་རྟག་ཏུ་དགའ་བགྱིད་པ།
en: Its radiance like that of the Paranirmita gods—always delighting.

source: །ཡོངས་སུ་དག་ཅིང་མཛེས་པ་འཐོབ་པར་འགྱུར།
en: In this most excellent buddhafield,

source: །དམ་པའི་ཞིང་དུ་ལུས་དང་ངག་ཡིད་ཀྱིས། །སེམས་ཅན་དག་ནི་རྣམ་པར་དག་པར་འགྱུར།
en: Beings are completely pure in terms of body, speech, and mind. “ ‘Such qualities and many more will be obtained

source: །རྒྱལ་བ་མཆོད་མི་ཡིས་འདི་ལ་སོགས། །ཡོན་ཏན་རྣམ་པ་དུ་མ་འཐོབ་པར་འགྱུར།
en: By the persons worshiping the Victorious One,

source: །མཐོ་རིས་ཐར་པ་མི་ཡི་བདེ་བ་དང་། །འགྲོ་བ་ཀུན་གྱི་བསོད་ནམས་གཏེར་འཐོབ་འགྱུར།
en: As well as liberation in the higher realms, bliss among humans, And the treasury of merit for all beings.

source: །ཁྱོད་ཀྱི་བརྗོད་དང་གྲགས་པ་རྒྱ་ཆེན་པོ།
en: “ ‘Your fame and renown are widespread

source: །ཕྱོགས་རྣམས་ཀུན་གྱི་ཞིང་མང་བརྒྱར་ཡང་མཆིས།
en: In the many hundreds of buddhafields in all directions,

source: །རྒྱལ་བ་ཁྱོད་ཀྱི་བསྔགས་པའི་ཕྲེང་བ་ནི།
en: Where, Victorious One, the sugatas, among the retinues,

source: །བདེ་བར་གཤེགས་རྣམས་འཁོར་དུ་རྟག་པར་སྒྲོགས།
en: Forever extol the litany of your qualities.

source: །རིམས་ནད་བྲལ་ཞིང་འགྲོ་བ་ཐར་མཛད་པ།
en: “ ‘I praise you, one who frees beings from plague and liberates them,

source: །མཐོང་ན་དགའ་བ་ཐུགས་རྗེ་མཆོག་ལྡན་པ།
en: Who is lovely to behold, possessing the highest compassion,

source: །བཅོམ་ལྡན་དབང་པོ་ཞི་བ་ཞི་དགྱེས་པ།
en: Who has pacified the senses, O Bhagavān, rejoicing in peace,

source: །མི་མཆོག་དམ་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: Most great, supreme one among men.

source: །བདག་གིས་རྒྱལ་བ་ཁྱོད་ཀྱི་གསུང་ཐོས་ནས།
en: “ ‘O Victorious One, upon hearing your teaching,

source: །མངོན་པར་ཤེས་པ་ལྔ་ཐོབ་མཁའ་ལ་གནས།
en: Standing in space, I obtained the five kinds of superknowledge.

source: །དཔའ་བོ་བདེ་གཤེགས་མཚུངས་པར་བདག་འགྱུར་ཏེ།
en: Upon becoming a hero, equal to a sugata,

source: །དྲི་མེད་ཆོས་ནི་འགྲོ་ལ་རྣམ་པར་དབྱེ།
en: I will disclose the stainless Dharma to the world!

source: །ལྷ་དང་མི་དང་ཀླུས་མཆོད་བདེ་བར་གཤེགས།
en: “ ‘May the world attain the state of buddhahood,

source: །ཡོན་ཏན་ཀུན་གྱི་མཐར་ཕྱིན་དེང་བསྟོད་པས། །བསོད་ནམས་རྒྱ་ཆེན་གང་བསྒྲུབས་གྱུར་པ་དེས།
en: Through the extensive merit obtained today By praising the Sugata, who has perfected all good qualities And is honored by gods, men, and nāgas.’

source: །འགྲོ་བ་སངས་རྒྱས་གོ་འཕང་ཐོབ་པར་ཤོག །ཡུལ་འཁོར་སྐྱོང་དེ་ནས་མཚན་མོ་དེའི་ནམ་ནངས་པ་དང་། རྒྱལ་པོ་འོད་ཟེར་ལྡན་གྱིས་གཞོན་ནུའི་བུད་མེད་ཀྱི་འཁོར་དུ་ངུ་བའི་སྒྲ་ཐོས་སོ།
en: “At this point, Rāṣṭrapāla, the day was dawning, and King Arciṣmān heard the sound of weeping in the quarters of the young prince’s women.

source: །ཐོས་ནས་ཀྱང་མྱུར་བ་མྱུར་བར་རིངས་པའི་གཟུགས་ཀྱིས་གྲོང་ཁྱེར་དགའ་མཆོག་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Having heard it, he went with great haste to the city of Ratipradhāna.

source: །ཁྱེད་ཅིའི་ཕྱིར་དུ། དེ་དག་གིས་སྨྲས་པ། རྒྱལ་བུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་འོད་ཟེར་མི་གདའ་བའི་སླད་དུའོ། །ཡུལ་འཁོར་སྐྱོང་དེ་ནས་རྒྱལ་པོ་འོད་ཟེར་ལྡན་གཞོན་ནུའི་ཕྱིར་ཤིང་བཅད་པ་བསྒྱེལ་བ་ལྟར་ས་ལ་འགྱེལ་ཏེ་ལངས་ནས་ངུ་ཞིང་གྲོང་ཁྱེར་དེར་ལན་སྟོང་དུ་ཡོངས་སུ་བཙལ་ཏོ།
en: Upon arriving there, he asked, ‘Why are you weeping?’ They answered, ‘Because prince Puṇyaraśmi is not here.’ Then, Rāṣṭrapāla, King Arciṣmān, for the sake of the prince, fell to the ground like a felled tree.

source: །ཡུལ་འཁོར་སྐྱོང་དེ་ནས་གྲོང་ཁྱེར་དེ་ན་གྲོང་ཁྱེར་གྱི་ལྷ་གང་ཡིན་པ་དེས་རྒྱལ་པོ་འོད་ཟེར་ལྡན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Upon rising, he wept and searched the city a thousand times. Then, Rāṣṭrapāla, the main deity of that city said this to King Arciṣmān:

source: །རྒྱལ་པོ་ཆེན་པོ་གཞོན་ནུ་ནི་དེ་བཞིན་གཤེགས་པ་དོན་གྲུབ་བློ་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། མཆོད་པ་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་ཤར་ཕྱོགས་ལོགས་སུ་སོང་ངོ་། །ཡུལ་འཁོར་སྐྱོང་དེ་ནས་རྒྱལ་པོ་འོད་ཟེར་ལྡན་གཞོན་ནུ་བཙལ་བའི་ཕྱིར་བཙུན་མོའི་འཁོར་དང་། སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་དང་ལྷན་ཅིག་ཏུ་ཤར་ཕྱོགས་ཀྱི་ཆ་ག་ལ་བ་དེར་སོང་སྟེ།
en: “ ‘The prince has departed to the east, great king, in order to behold, praise, worship, and serve the Tathāgata Siddhārthabuddhi.’ Then, Rāṣṭrapāla, to search for him, King Arciṣmān, along with a retinue of ladies of the court and myriad beings, departed for the eastern direction where the prince had gone.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དོན་གྲུབ་བློ་ག་ལ་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ཀྱང་རྒྱལ་པོ་འོད་ཟེར་ལྡན་གྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པས་མངོན་པར་བསྟོད་པ།
en: He came before the tathāgata, the arhat, the perfect and complete Buddha Siddhārthabuddhi, and, bowing his head toward the feet of that Bhagavān, stood to one side. Standing to one side, King Arciṣmān praised the Bhagavān with the following verses:

source: སྲིད་གསུམ་ཁྱོད་མཚུངས་མ་མཆིས་ལྷག་པ་ག་ལ་མཆིས།
en: “ ‘No one in the three worlds is your equal, let alone a superior.

source: །སེམས་ཅན་དམ་པ་ལྷ་དབང་ལྷ་མིན་རྒྱལ་པོས་བཀུར།
en: Excellent being, honored by the lord of the gods and the king of the asuras,

source: །སྐྱེ་བོ་ཁྱོད་ཀྱི་གཟུགས་ལ་ལྟ་བས་ངོམས་མི་འགྱུར།
en: Beings never tire of gazing at your body;

source: །ཡོན་ཏན་ཡེ་ཤེས་རྒྱ་མཚོ་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to you, glorious ocean of qualities and wisdom.

source: །རྒྱལ་བ་ཁྱོད་སྐུ་སུམ་ཅུ་རྩ་གཉིས་མཚན་རབ་དག །ལྷུན་པོ་རིན་ཆེན་མཆོག་གིས་སྤྲས་ལྟར་ཡོངས་སུ་དག །རྒྱལ་བ་སྡུག་ཅིང་འཇམ་ལགས་གསེར་གྱི་ཁ་དོག་འདྲ།
en: “ ‘Victorious One, your thirty-two buddha marks are extremely pure. You are like Mount Meru adorned with sublime jewels, completely pure. Victorious One, beautiful, smooth, resembling the color of gold,

source: །བལྟ་སྡུག་གཟུགས་མངའ་ཐུབ་པའི་སྐུ་ལ་ཕྱག་འཚལ་ལོ།
en: Pleasant to behold is your physique—to the body of the Sage I pay homage!

source: །བསྐལ་པ་བྱེ་བརྒྱ་བསམ་གྱིས་མི་ཁྱབ་བརྟུལ་ཞུགས་སྤྱད།
en: “ ‘For inconceivable myriad eons, you have practiced firm observance.

source: །བསྐལ་པ་བྱེ་བ་བརྒྱ་མང་སངས་རྒྱས་བསྟི་སྟང་མཛད།
en: For inconceivable myriad eons, you have paid respect to the buddhas.

source: །སྔོན་ཆད་མཆོད་སྦྱིན་བརྒྱ་ཕྲག་བསམ་གྱིས་མི་ཁྱབ་མཛད།
en: You made inconceivable hundreds of offerings in the past.

source: །དེས་ན་ཁྱོད་སྐུ་བཟང་ཞིང་ཤིན་ཏུ་མཛེས་པ་ལགས།
en: Therefore, your body is beautiful and very captivating.

source: །སྦྱིན་དང་ཚུལ་ཁྲིམས་ཏིང་ངེ་འཛིན་དང་ཤེས་རབ་དང་། །བཟོད་དང་བརྩོན་འགྲུས་བསམ་གཏན་ཐབས་ཀྱིས་ཁྱོད་གཟུགས་སྦྱངས།
en: “ ‘By your generosity, discipline, concentration, and insight, By your patience, diligence, absorption, and skillful means, you have refined your form.

source: །ཁྱོད་ཀྱི་སྤྱན་སྔར་བརྒྱ་བྱིན་ཚངས་འོད་གསལ་མ་ལགས།
en: In your presence, Indra and Brahmā fade.

source: །ཆུ་ཤེལ་ནོར་བུ་གློག་གི་འོད་ཀྱང་མཛེས་མ་ལགས།
en: Even the flash of the moonstones and sunstones is not as resplendent.

source: །འགྲོ་བའི་དོན་དུ་ཡིད་དུ་མཆི་བའི་གཟུགས་ཀྱང་སྟོན།
en: “ ‘For the sake of beings, you manifest a lovely shape.

source: །ཆུ་ཟླ་འདྲ་ཞིང་སྒྱུ་མ་འདྲ་བར་གདའ་བ་ལགས།
en: You are present like the moon in the water and an illusion.

source: །རང་གི་ཕྱོགས་རྣམས་ཀུན་ཏུ་རྒྱལ་བའི་སྐུ་ཡང་གདའ།
en: The Victorious One’s body is present in all our directions.

source: །བདེ་གཤེགས་རྣམས་ཀྱི་སྐུ་ཡི་ཚད་ནི་གདའ་མ་ལགས།
en: The Sugata’s body is beyond measure.

source: །ཁྱོད་ནི་དགའ་ལྡན་འགའ་ཞིག་ན་ཡང་བཞུགས་པར་གདའ།
en: “ ‘At one time, you resided among the Tuṣita gods.

source: །འཆི་འཕོ་མཛད་ཅིང་རབ་དཀར་གླང་པོར་གྱུར་ནས་ནི།
en: Upon transmigrating and becoming a splendidly white elephant,

source: །དཔའ་བོ་ཡུམ་གྱི་ལྷུམས་སུ་གཤེགས་པར་གདའ་བ་མཛད།
en: You, O hero, entered your mother’s womb.

source: །ཐུབ་ཆེན་ནམ་མཁའ་ལྟ་བུར་ཐམས་ཅད་རྗེས་སུ་ཞུགས།
en: Great sage, you extend everywhere, just like the sky.

source: །བཅོམ་ལྡན་ཕྱོགས་འགར་བལྟམ་པར་སྟོན་པའང་མཛད་པ་སྟེ།
en: “ ‘At one time, O Bhagavān, you appeared to take birth in a particular place.

source: །ས་འགའ་དག་ཏུ་གོམ་པ་བདུན་པོར་གདའ་བ་མཛད།
en: You walked seven steps in each of the cardinal directions and announced,

source: །ང་ནི་ལྷ་མིར་བཅས་འགྲོ་ནང་གཙོ་ཤིན་ཏུ་ལྟ།
en: “I am the highest lord in the world, together with its gods and men;

source: །འགྲོ་བ་སྡུག་བསྔལ་མཚོ་ལས་གདོན་ཅེས་གསུང་ཡང་ཕྱུང་།
en: I will rescue beings from the ocean of suffering.”

source: །ཐུབ་ཁྱོད་ཆོས་གང་ལ་ཡང་ཐེ་ཚོམ་མི་མངའ་ཡང་།
en: “ ‘Sage, although you had no doubts regarding the Dharma,

source: །ཡི་གེ་ཤེས་པ་སློབ་ལྟར་འཇིག་རྟེན་དག་ན་གདའ།
en: At one time you lived in the world, as if you needed to learn the science of letters.

source: །བསམ་གཏན་ཏིང་འཛིན་སྤྱོད་ཡུལ་ཞི་བ་བརྙེས་གྱུར་ཀྱང་།
en: Although you found peace within the sphere of meditative absorption and concentration,

source: །ཁ་ཅིག་ཏུ་ནི་བུད་མེད་ནང་ན་བཞུགས་པར་གདའ།
en: You remained for a certain time amidst women.

source: །ཡབ་དང་ཡུམ་དང་སྲས་དང་བུད་མེད་རྣམས་ཀྱང་བཏང་།
en: “ ‘You left father, mother, son, and wives;

source: །གཉན་རྣམས་མྱ་ངན་ནོན་ཏེ་རྣམ་པར་བརྒྱལ་ཞིང་ངུ་།
en: Your relatives were overcome with suffering, fainting, and weeping.

source: །སེམས་ཅན་དམ་པ་བྱེ་བ་བརྒྱ་ལྷས་ཡོངས་བསྐོར་ནས།
en: O excellent being, surrounded by a billion gods,

source: །ནགས་གནས་གནས་གཅིག་པོ་ནས་འབྱུང་བར་གདའ་བ་འང་མཛད།
en: Having gone forth, you stayed in the forest on your own.

source: །ཁྱོད་ནི་བདུད་བཞི་ཕམ་པར་མཛད་ནས་ཡུན་རིང་ཡང་།
en: “ ‘Although you have defeated the four māras a long time ago,

source: །ཞིང་ན་བདུད་འདུལ་བ་ཡང་གདའ་བ་སྟོན་པར་མཛད།
en: You showed yourself in this realm to subdue the māras here as well.

source: །སྔོན་ཆད་འཁོར་ལོ་བསམ་གྱིས་མི་ཁྱབ་བསྐོར་གྱུར་ཀྱང་།
en: Although you turned the inconceivable wheel in earlier times,

source: །ཁྱོད་ནི་ཐུགས་རྗེས་འཁོར་ལོ་བསྐོར་བར་གདའ་བ་མཛད།
en: You showed yourself out of compassion to turn the wheel here as well.

source: །རྟག་ཏུ་རྟག་ལྟ་འདུ་ཤེས་ལྡན་པའི་འགྲོ་གཟིགས་ནས།
en: “ ‘Beholding beings, who constantly entertain eternalist views,

source: །མྱ་ངན་འདའ་ཞེས་འཁོར་གྱི་ནང་དུ་ཚིག་ཏུ་གསུང་།
en: You say to your retinue, “I will go beyond suffering.”

source: །རྟག་ཏུ་འཁོར་བར་དགའ་བའི་འགྲོ་བ་གཟིགས་ནས་ནི།
en: Beholding beings who always delight in saṃsāra,

source: །ཁྱོད་ནི་ཞི་བ་བསིལ་གྱུར་མྱ་ངན་འདས་པ་གསུང་།
en: You speak of extinguishment —peaceful and cooling.

source: །ཁྱོད་ཀྱི་བསོད་ནམས་ཡེ་ཤེས་ཤེས་རབ་ཐབས་མཚུངས་མེད།
en: “ ‘You are unequaled in merit, wisdom, insight, and skillful means.

source: །ཐུབ་པ་ཁྱོད་སྐུ་འོད་ཀྱིས་ཞིང་མང་རྒྱས་པར་འགེངས།
en: Your body’s splendor, O Sage, radiates throughout myriad buddhafields.

source: །ཕྱོགས་རྣམས་དག་ན་འདྲེན་པ་ཁྱོད་ཀྱི་བསྔགས་པ་གསུང་།
en: Leaders in all directions offer praise to you.

source: །ཀུན་དུ་སྤྱོད་ཡུལ་ཐུབ་པའི་རྒྱལ་ལ་ཕྱག་འཚལ་ལོ།
en: I praise you, O King of Sages, whose experiential sphere reaches everything.

source: །ཆོས་ཉིད་མ་ལུས་བརྙེས་པར་གྱུར་ལ་ཕྱག་འཚལ་ལོ།
en: “ ‘I praise you, one who has fully realized the nature of reality.

source: །སེམས་ཅན་ཀུན་གྱི་བགྱི་བ་སྒྱུ་མ་ལྟར་གདའ་ཡང་།
en: While you are present in the affairs of all sentient beings like an illusion,

source: །ཐུབ་པ་ཁྱོད་ནི་གང་དུ་བཞུད་པའམ་བྱོན་མ་ལགས།
en: You actually come and go nowhere, O Sage.

source: །སྒྱུ་མའི་ཆོས་ཚུལ་གནས་ལ་མངོན་པར་ཕྱག་འཚལ་ལོ། །འགྲོ་བའི་དོན་དུ་གང་གིས་བྱང་ཆུབ་མཆོག་ཐོབ་པ།
en: I praise you, one who is firmly established, your apparitions being illusory.

source: །ལམ་མཆོག་མི་ཡི་དཔའ་བོ་ཁྱོད་ནི་ལེགས་པར་གསུང་།
en: “ ‘You, O hero of men, excellently teach the supreme path By which one attains supreme enlightenment for the sake of beings.

source: །བདག་གིས་ཆོས་ཉིད་འདི་ནི་མྱུར་དུ་སངས་རྒྱས་ནས།
en: Having quickly awakened to the nature of reality,

source: །མི་དཔའ་འགྲོ་བའི་དོན་དུ་ཆོས་ཉིད་བཤད་པར་བགྱི།
en: I shall teach it for the sake of beings, O hero of men.

source: །མི་ཡི་དཔའ་བོ་ཐུབ་པ་ཀུན་མཁྱེན་རིམས་བྲལ་བ།
en: “ ‘O hero of men, omniscient Sage, free from disease

source: །སྲིད་གསུམ་མཚུངས་པ་མ་མཆིས་ལྷག་པ་ག་ལ་ཞིག །བདག་གིས་འདིར་བསྟོད་བསོད་ནམས་དམ་པ་གང་བསྒྲུབས་དེས།
en: And unequaled in the three worlds—who could be more extraordinary?

source: །འཇིག་རྟེན་བྱང་ཆུབ་བླ་མེད་ཞི་མཆོག་ཐོབ་པར་ཤོག །ཡུལ་འཁོར་སྐྱོང་དེ་ནས་དེ་བཞིན་གཤེགས་པ་དོན་གྲུབ་བློ་དེས་རྒྱལ་པོ་འོད་ཟེར་དེའི་ལྷག་པའི་བསམ་པ་མཁྱེན་ནས་ཅི་ནས་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཆོས་བསྟན་ཏོ།
en: May the world attain unexcelled, peaceful, and excellent enlightenment By the excellent merit I accumulated in this praise!’ “At this point, Rāṣṭrapāla, the Tathāgata Siddhārthabuddhi, upon realizing the extraordinary intent of King Arciṣmān, taught the Dharma in such a way that no one would turn away from unsurpassable, completely perfect enlightenment.

source: །ཡུལ་འཁོར་སྐྱོང་དེ་ནས་རྒྱལ་བུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་འོད་ཟེར་གྱིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དོན་གྲུབ་བློ་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སང་བདག་གི་གྲོང་ཁྱེར་དུ་གདུགས་ཚོད་གསོལ་བར་གནང་བར་མཛད་དུ་གསོལ། །བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་བུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་འོད་ཟེར་ལ་ཐུགས་བརྩེ་བར་དགོངས་ཏེ་ཅང་མི་གསུང་བར་གྱུར་པས་གནང་ངོ་།
en: Then, Rāṣṭrapāla, young prince Puṇyaraśmi requested the bhagavān, the Tathāgata Siddhārthabuddhi, ‘I beseech you, Bhagavān, to take your meal in our city tomorrow.’ The Bhagavān, out of kindheartedness for young prince Puṇyaraśmi, agreed without uttering a word.

source: །ཡུལ་འཁོར་སྐྱོང་དེ་ནས་རྒྱལ་བུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་འོད་ཟེར་གྱིས་ཕ་མ་དེ་གཉིས་དང་གྲོགས་དེ་དག་དང་བུད་མེད་དེ་དག་ལ་སྨྲས་པ།
en: Then, Rāṣṭrapāla, young prince Puṇyaraśmi proclaimed to his parents, friends, and women, ‘All of you, rejoice!

source: ཁྱེད་ཅག་ཐམས་ཅད་རྗེས་སུ་ཡི་རང་བར་གྱིས་ཤིག །ཅི་ནས་གྲོང་ཁྱེར་དགའ་མཆོག་བརྒྱན་ཏེ་མ་ཆགས་པར་དེ་བཞིན་གཤེགས་པ་ལ་དབུལ་དུ་རུང་བར་གྱིས་ཤིག །དེ་དག་གིས་སྒྲ་སྐད་གཅིག་ཏུ་རྗེས་སུ་ཡི་རང་ངོ་།
en: “ ‘Would you agree to make the richly ornamented city of Ratipradhāna into a suitable offering for the Tathāgata, without attachment?’—They rejoiced unanimously.

source: །ཡུལ་འཁོར་སྐྱོང་དེ་ནས་རྒྱལ་བུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་འོད་ཟེར་གྱིས་ཅི་ནས་གྲོང་ཁྱེར་དགའ་མཆོག་བརྒྱན་ཏེ་མ་ཆགས་པར་དེ་བཞིན་གཤེགས་པ་ལ་ཕུལ་ལོ།
en: Then, Rāṣṭrapāla, young prince Puṇyaraśmi proceeded to offer the richly ornamented city of Ratipradhāna to the Tathāgata, without attachment.

source: །རོ་བྲོ་བ་བཀོད་པ་ལྔ་བརྒྱ་པའི་ཞལ་ཟས་ཀྱང་དེ་བཞིན་གཤེགས་པ་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་དེ་ལ་གསོལ་ཏོ།
en: He offered to the Tathāgata, together with his assembly of monks, food with the full range of five hundred flavors.

source: །དགེ་སློང་དེ་དག་ཐམས་ཅད་ཀྱི་ཕྱིར་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་གཡོགས་པའི་གཙུག་ལག་ཁང་ནོར་བུའི་འཆག་ས་བཤམས་པ་སྟེང་དུ་རིན་པོ་ཆེའི་དྲ་བའི་བླ་རེ་བྲེས་པ། གཡས་གཡོན་དུ་མེ་ཏོག་གི་ཤིང་ལྗོན་པ་ལེགས་པར་ཡོངས་སུ་གྲུབ་པ། མེ་ཏོག་པད་མ་དཀར་པོའི་རྫིང་གིས་མཛེས་པར་བྱས་པ། རས་བཅོས་བུ་མུ་གཉིས་དྲི་མ་མེད་པ་བརྒྱ་སྟོང་བཏིང་བའི་མལ་བཤམས་པ།
en: To all these monks he offered a monastery covered in seven precious substances, bedecked with jeweled pathways, and adorned on top with a canopy of jeweled nets. To the right and left, groves of flower trees were carefully planted, beautified with ponds of white lotus flowers. Beds were swathed in a hundred thousand pieces of calico fabric, stainless on both sides.

source: དགེ་སློང་རེ་རེ་ལ་གོས་ཁ་ན་མ་ཐོ་བ་མེད་པ་གང་བྱིན་པ་དེ་ཕྱི་དེ་ཉིན་མི་སྦྱིན་གྱི་ཉིན་གཅིག་བཞིན་གོས་གཞན་དང་གཞན་སྦྱིན་པར་འགྱུར་བ་བྱས་སོ།
en: To each monk he gave flawless robes, and day after day he offered additional robes.

source: །དེ་ལོ་བྱེ་བ་ཕྲག་གསུམ་གྱི་བར་དུ་རྨུགས་པ་དང་གཉིད་ཀྱིས་ནོན་པར་མ་གྱུར་བདག་ལ་དགའ་བ་མ་བྱས། སངས་རྒྱས་ལ་མཆོད་པའི་ཕྱིར་གཞན་ཡིད་ལ་མ་བྱས་སོ།
en: For thirty million years he was not overcome by drowsiness or torpor, and he did not act out of self-cherishing. Worshiping the buddha, he did not turn his mind to anything else.

source: །བར་སྐབས་དེར་འདོད་པ་ལ་རྣམ་པར་རྟོག་པ་དང་། གནོད་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་དང་འཚེ་བའི་རྣམ་པར་རྟོག་པས་རྣམ་པར་རྟོག་པར་མ་གྱུར།
en: “For the duration of that period, the concept of desire, the concept of harming others, and the concept of causing harm did not arise.

source: རྒྱལ་སྲིད་ལ་སྲེད་པར་མ་གྱུར་ཏེ་ལུས་དང་སྲོག་ལ་ཡང་མི་ལྟ་ན་དངོས་པོ་གཞན་དག་ལ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: A craving for kingship did not arise. He had no concern for his body or his life force, let alone for anything else.

source: བར་སྐབས་དེར་བཅོམ་ལྡན་འདས་ཀྱིས་གང་གསུངས་པ་དེ་ཐམས་ཅད་ཀུན་ཏུ་བཟུང་སྟེ་དེ་བཞིན་གཤེགས་པ་དེ་ལ་དེ་ལན་གཉིས་སུ་མ་ཞུས་སོ།
en: During that time, he completely understood what the Bhagavān had taught, and thus he did not ask the Tathāgata a second time.

source: །བར་སྐབས་དེར་ཁྲུས་མ་བྱས་མར་དང་འབྲུ་མར་གྱིས་ལུས་མ་བསྐུས་རྐང་བ་མ་བཀྲུས་ངལ་བའི་འདུ་ཤེས་མ་བསྐྱེད་དོ།
en: For the duration of that period, he did not bathe or anoint his body with ghee or sesame oil or wash his feet, nor did he conceive of his hardships.

source: །ཟན་ཟ་བ་དང་བཤང་གཅི་བྱེད་པ་མ་གཏོགས་པར་ནམ་ཡང་འདུག་པར་མ་གྱུར་ཏོ།
en: He never sat down except to eat, defecate, or urinate.

source: །གང་གི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དེའི་ཚེ་ཙན་དན་དམར་པོའི་ཞུགས་ལ་བཞེན་པ་བྱས་སོ།
en: When the Tathāgata entered parinirvāṇa, Puṇyaraśmi had a funeral pyre of red sandalwood erected for his ritual cremation.

source: །གང་དུ་དེ་བཞིན་གཤེགས་པ་དེ་ཞུགས་ལ་བཞེན་པའི་ས་ཕྱོགས་དེ་ཉིད་དུ་འཛམ་བུའི་གླིང་ཐམས་ཅད་པའི་མེ་ཏོག་ཐམས་ཅད་དང་། ཕྲེང་བ་ཐམས་ཅད་དང་། སྤོས་ཐམས་ཅད་དང་། རོལ་མོའི་སྒྲ་ཐམས་ཅད་ཀྱིས་ལོ་བརྒྱ་སྟོང་དུ་རིང་བསྲེལ་ལ་མཆོད་པ་བྱས་པར་གྱུར་པ་ནས་རྒྱུ་རྐྱེན་ཐམས་ཅད་བསོགས་ཏེ་ཕྱིས་མཆོད་རྟེན་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིའི་བར་དུ་བྱས་སོ།
en: “At the very spot where the Tathāgata had been cremated, Puṇyaraśmi worshiped his relics with all the flowers, garlands, incense, and sounds of musical instruments of the entire world for a hundred thousand years. Thus, having brought together all causes and conditions, he caused as many as eight hundred forty million stūpas to be built.

source: །མཆོད་རྟེན་དེ་དག་ལ་ཡང་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རིན་པོ་ཆེའི་དྲ་བས་གཡོགས་སོ། །མུ་ཏིག་གི་དྲ་བའི་བླ་རེ་དག་བྲེས་སོ།
en: These stūpas were covered in precious lattices made of the seven precious substances and were sheltered by canopies made of pearl lattices.

source: །མཆོད་རྟེན་རེ་རེ་ལ་ཡང་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གདུགས་ལྔ་བརྒྱ་ལྔ་བརྒྱ་ཕུལ་ལོ།
en: Moreover, on each stūpa he raised five hundred parasols made of the seven precious substances;

source: །མཆོད་རྟེན་ཐམས་ཅད་ལ་ཡང་སིལ་སྙན་བརྒྱ་སྟོང་ཕུལ་ལོ།
en: and furthermore, at each stūpa he sounded hundreds of thousands of cymbals.

source: །འཛམ་བུའི་གླིང་ཁོ་ར་ཁོར་ཡུག་ཏུ་མེ་ཏོག་གི་ཤིང་ལྗོན་པ་བསྐྲུན་ཏོ།
en: He planted flower trees in all corners of the world.

source: །མཆོད་རྟེན་རེ་རེ་ལ་ཡང་མར་མེའི་རྫ་བོ་བརྒྱ་སྟོང་ནས་མར་མེ་བུས་སོ།
en: At each stūpa, he lit lamps on a hundred thousand lamp stands.

source: །མར་མེའི་རྫ་བོ་རེ་རེ་ནས་ཀྱང་སྤོས་ཀྱི་འབྲུ་མར་དྲུག་ཅུ་རྩ་བཞི་པ་སྟོང་གི་མར་མེ་བུས་སོ།
en: Moreover, on each of these lamp stands, sixty-four thousand lamps with scented oil were lit.

source: །སྤོས་དང་ཕྲེང་བ་དང་བྱུག་པ་ཐམས་ཅད་ཀྱིས་ཀྱང་མཆོད་པ་བྱས་སོ།
en: Moreover, he worshiped with many varieties of incense, garlands, and ointments.

source: །ཚུལ་དེ་ལྟ་བུས་ལོ་བྱེ་བའི་བར་དུ་མཆོད་པ་བྱས་ཏེ་ཕྱིས་རབ་ཏུ་བྱུང་ངོ་།
en: In such ways he worshiped for as many as ten million years, and subsequently became a renunciant.

source: །དེ་རབ་ཏུ་བྱུང་ནས་ཀྱང་ཆོས་གོས་གསུམ་པར་གྱུར་ཅིང་རྟག་ཏུ་བསོད་སྙོམས་སྤྱོད་པ་དང་རྟག་ཏུ་ཅོག་བུ་བ་སྟེ་ནམ་ཡང་གློས་མ་ཕབ་བོ།
en: “Having become a renunciant, he put on the three Dharma robes, continually engaged in begging for alms, and always slept in a seated posture without ever lying down.

source: །ནམ་ཡང་རྨུགས་པ་དང་གཉིད་ཀྱིས་ནོན་པར་མ་གྱུར་ཏོ།
en: He never became overwhelmed by drowsiness and torpor.

source: །དེས་ཟང་ཟིང་མེད་པའི་སེམས་ཀྱིས་ལོ་བྱེ་བ་ཕྲག་བཞིའི་བར་དུ་ཆོས་ཀྱི་སྦྱིན་པ་བྱིན་ཏེ།
en: With a mind free from worldly concerns, he offered the gift of Dharma for as long as forty million years.

source: དེས་གཞན་ལ་ཐ་ན་ལེགས་སོ་ཞེས་བྱ་བ་ཙམ་ཡང་རེ་བར་མ་གྱུར་ན་རྙེད་པ་དང་བཀུར་སྟི་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: He did not expect even appreciation from others, let alone gain and honor.

source: དེ་ཆོས་མཉན་པའམ་ཆོས་བཤད་པས་ཀྱང་ངལ་བར་མ་གྱུར་ཏོ་དེ་ལ་ལྷ་རྣམས་ཀྱང་བསྙེན་བཀུར་བྱེད་དོ།
en: He also never tired of listening to the Dharma or explaining it. Even the gods served him.
